#Тимофей обычно спит ночью XX часов и устраивает себе днем тихий час на YY минут. Определите, сколько всего минут Тимофей спит в сутки. 
# Sample Input:7 30    Sample Output: 450
X = int(input())
Y = int(input())
print(X*60 + Y)